In [1]:
#Import Pandas

In [2]:
# Create three series with the following info
"""
{
    'Name': 'Alice',
    'Class': 'Physics',
    'Score': 85
}

{
    'Name': 'Jack',
    'Class': 'Chemistry',
    'Score': 82
}

{
    'Name': 'Helen',
    'Class': 'Biology',
    'Score': 90
}
"""
# Then, pass in all 3 series into a new dataframe with the indices set as
# school1, school2, school1

"\n{\n    'Name': 'Alice',\n    'Class': 'Physics',\n    'Score': 85\n}\n\n{\n    'Name': 'Jack',\n    'Class': 'Chemistry',\n    'Score': 82\n}\n\n{\n    'Name': 'Helen',\n    'Class': 'Biology',\n    'Score': 90\n}\n"

In [3]:
# Do the same as above, but inject the values straight into the dataframe

In [4]:
# Return the second entry, School2, as a series
# QUESTION: If you do the same with School1, what would you get back and why?

In [5]:
# Turn all the rows into columns and all the columns into rows in our previous 
# Data frame

In [6]:
# Using the data frame above, extract all the names in school1 using chaining
# QUESTION: What would the same command look like for school2 and why

In [7]:
# Get all the names and scores for all schools using the loc attribute as a DF, 
# without chaining
# Hint: How would you get every value inside a [] operator?

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [8]:
# Using the appropriate methods
# Make a copy of our data frame
# Then, drop school1 in that copy

In [9]:
# Let's do the same, with a second copy.
# This time, drop the name column, both in the copy, and in the original
# Do both drops in the same line

In [10]:
# Drop the class column in our original dataframe using the del keywork

         Score
school1     85
school2     82
school1     90

In [45]:
# Add a new column to our original dataframe. call it Class ranking and set it to none